import { FC } from "react";

export const AlphaText: FC = () => {
  return (
    <div className="grid place-items-center">
      {/* prettier-ignore */}
      <pre className="hidden md:block whitespace-pre text-teal-700">
{" "}█████╗ ██╗     ██████╗ ██╗  ██╗ █████╗ <br />
██╔══██╗██║     ██╔══██╗██║  ██║██╔══██╗<br />
███████║██║     ██████╔╝███████║███████║<br />
██╔══██║██║     ██╔═══╝ ██╔══██║██╔══██║<br />
██║  ██║███████╗██║     ██║  ██║██║  ██║<br />
╚═╝  ╚═╝╚══════╝╚═╝     ╚═╝  ╚═╝╚═╝  ╚═╝
      </pre>
      <div className="block md:hidden">
        <br />
        <p className="text-teal-700">~/dotfiles/alpha</p>
        <br />
      </div>
    </div>
  );
};
